<a href="https://colab.research.google.com/github/AteneaCB/Python/blob/main/Sesi%C3%B3n5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Sesión 5**
Funciones vectorizadas y limpieza de datos

**Ejemplo 1**
Fucniones vectorizadas con series

- Aprender cómo usar Funciones vectorizadas aplicadas a `Series` de Pandas

In [4]:
import pandas as pd
import numpy as np

In [ ]:
serie_1 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [ ]:
#Funciones vectorizadas
np.power(serie_1, 2)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

In [ ]:
np.sqrt(serie_1)

0    1.000000
1    1.414214
2    1.732051
3    2.000000
4    2.236068
5    2.449490
6    2.645751
7    2.828427
8    3.000000
9    3.162278
dtype: float64

**Reto 1**
Funciones vectorizadas

**a) Porcentaje del total**
El conteo máximo de aciertos en el examen era de 68 (es decir, 68 aciertos equivale al 100% de las preguntas respondidas correctamente). La siguiente Serie reúne los aciertos obtenidos por los 25 alumnos de la generación

In [ ]:
aciertos = pd.Series([50, 55, 45, 65, 66, 46, 48, 53, 55, 56, 59, 68, 67, 60, 45, 56, 66, 64, 59, 55, 34, 45, 49, 48, 55])

In [ ]:
por_100 = np.multiply(aciertos, 100)
entre_68 = np.divide(por_100, 68)
porcentajes = entre_68

In [ ]:
#Comparar función de verificación
def obtener_calificaciones(aciertos, porcentajes):    
    porcentajes_correcto = np.divide(np.multiply(aciertos, 100), 68)
    if not porcentajes_correcto.equals(porcentajes):
        print(f'Hay algún error en tus cálculos...')
        print(f'¡Por favor intenta de nuevo!')
        return
        
    print(f'== Calificaciones finales ==\n')
    print(f'{("Id del Alumno"):15} | {("Porcentaje de Aciertos"):15}')
    print(f'----------------------------------------')
    for i in range(0, len(porcentajes)):
        print(f'{i:<15} | {np.round(porcentajes[i], 2):<}%')

**Ejemplo 2**
Agregaciones

- Aprender cómo usar agregaciones para resumir o reducir un arreglo

In [ ]:
serie_2 = pd.Series([1, 2, 3, 4, 5])

In [ ]:
#Entrega un sólo elemento. Aplican una función a todo el arreglo entero y regresan un único valor
serie_2.sum()

15

In [ ]:
serie_2.min()

1

In [ ]:
serie_2.max()

5

In [ ]:
serie_2.count()

5

**Reto 2**
Agregaciones

- Usar funciones vectorizadas y agregaciones para computar la desviación estándar de un conjunto de datos

In [ ]:
#Desviación estándar
edades = pd.Series([23, 24, 23, 34, 30, 17, 18, 24, 35, 28, 27, 27, 34, 32, 29, 16, 16, 17, 19, 34, 45, 46, 43, 45, 43, 32, 25, 29, 28, 38, 30, 37, 38, 24, 26, 25, 24, 19, 19, 18, 17, 18, 21, 20, 23, 24, 25, 25, 26, 24, 23, 32, 24, 25, 24, 36, 35, 36, 38, 39, 45, 46, 43, 48, 42, 41, 41, 26, 19, 19, 19, 20, 39, 38, 43, 28, 27, 39, 43, 52, 50, 38, 15, 17, 23, 25, 19, 32, 34, 35, 19, 19, 20, 26, 25, 43, 45, 46, 34, 33, 30, 30, 34, 45, 50, 50, 47, 25, 34, 37, 38, 19, 19, 20, 25, 28, 34, 32, 36, 39, 39, 28, 34, 33, 22, 25, 17, 17, 22, 24, 25, 45, 46, 43, 34, 35, 32, 23])

In [ ]:
#Suma y cantidades
suma = edades.sum()
cantidad = edades.count()
promedio = suma/cantidad
promedio

30.492753623188406

In [ ]:
#Los dos pasos anteriores son iguales a aplicar la Media
prom_edades = np.mean(edades)
prom_edades

30.492753623188406

In [ ]:
#Resta del promedio a cada elemento
resta = edades - promedio
resta

0      -7.492754
1      -6.492754
2      -7.492754
3       3.507246
4      -0.492754
         ...
133    12.507246
134     3.507246
135     4.507246
136     1.507246
137    -7.492754
Length: 138, dtype: float64

In [ ]:
#Serie al cuadrado
cuadrado = np.power(resta, 2)
cuadrado

0       56.141357
1       42.155850
2       56.141357
3       12.300777
4        0.242806
          ...
133    156.431212
134     12.300777
135     20.315270
136      2.271792
137     56.141357
Length: 138, dtype: float64

In [ ]:
suma_cuadrado = cuadrado.sum()
suma_cuadrado

12512.492753623188

In [ ]:
#Para la desviasión estándar de la muestra n-1
cantidad_2 = cantidad - 1
promedio_2 = suma_cuadrado/cantidad_2

In [ ]:
std = np.sqrt(promedio_2)
std

9.55678104254041

In [ ]:
#Comparar función de verificación
def comparar_std(edades, std):
    std = np.round(std, 6)
    espereada =  np.round(edades.std(), 6)
    print(f'== Comparación Desviaciones Estándares ==\n')
    print(f'Esperada: {espereada} - Recibida: {std}')
    print(f'Cálculo {"Correcto... Felicidades!" if espereada == std else "Incorrecto... Intenta de nuevo"}')

comparar_std(edades, std)

== Comparación Desviaciones Estándares ==

Esperada: 9.556781 - Recibida: 9.556781
Cálculo Correcto... Felicidades!

**Ejemplo 3**
Funciones vectorizadas y agregaciones con DataFrames

- Aprender cómo usar Funciones vectorizadas y agregaciones aplicadas a `DataFrames` completos

In [ ]:
tienda = {
    'precio':[34,56,123,450,456],
    'cantidad_en_stack':[3,6,10,50,2],
    'productos_vendidos': [3,56,30,40,45]
}

df = pd.DataFrame(tienda, index=['Tacos', 'Jabón', 'Ropa', 'Latas', 'Computadora'])
df

             precio  cantidad_en_stack  productos_vendidos
Tacos            34                  3                   3
Jabón            56                  6                  56
Ropa            123                 10                  30
Latas           450                 50                  40
Computadora     456                  2                  45

In [ ]:
df*100

             precio  cantidad_en_stack  productos_vendidos
Tacos          3400                300                 300
Jabón          5600                600                5600
Ropa          12300               1000                3000
Latas         45000               5000                4000
Computadora   45600                200                4500

In [ ]:
df*100/2

              precio  cantidad_en_stack  productos_vendidos
Tacos         1700.0              150.0               150.0
Jabón         2800.0              300.0              2800.0
Ropa          6150.0              500.0              1500.0
Latas        22500.0             2500.0              2000.0
Computadora  22800.0              100.0              2250.0

In [ ]:
np.power(df, 2)

             precio  cantidad_en_stack  productos_vendidos
Tacos          1156                  9                   9
Jabón          3136                 36                3136
Ropa          15129                100                 900
Latas        202500               2500                1600
Computadora  207936                  4                2025

In [ ]:
#A diferencia de las series, las agregaciones se hacen por columna
df.sum()

precio                1119
cantidad_en_stack       71
productos_vendidos     174
dtype: int64

In [ ]:
#Para hacerlo por fila, se puede indicar el eje, si es 0 es por columna, si es 1 es por fila
df.sum(axis=1)

Tacos           40
Jabón          118
Ropa           163
Latas          540
Computadora    503
dtype: int64

**Reto 3**
Agregaciones con DataFrames

- Aprender cómo usar Funciones vectorizadas y agregaciones aplicadas a `DataFrames` completos

a) Análisis estadístico con agregaciones
Tu tarea es muy simple. Usando métodos de agregación, asigna las variables de la siguiente celda con los resultados de agregar nuestro DataFrame por columna usando cada una de las medidas estadísticas.

In [ ]:
datos = {
    'producto': ["Pokemaster", "Cegatron", "Pikame Mucho", "Lazarillo de Tormes", "Stevie Wonder", "Needle", "El AyMeDuele", "El Desretinador", "Sacamel Ojocles", "Desojado", "Maribel Buenas Noches", "Cíclope", "El Cuatro Ojos"],
    'precio': [12000, 5500, 2350, 4800, 8900, 6640, 1280, 1040, 23100, 16700, 15000, 13400, 19600],
    'cantidad_en_stock': [34, 54, 36, 78, 56, 12, 34, 4, 0, 18, 45, 23, 5],
    'cantidad_vendidos': [120, 34, 59, 9, 15, 51, 103, 72, 39, 23, 10, 62, 59]
}

df = pd.DataFrame(datos)
df

                 producto  precio  cantidad_en_stock  cantidad_vendidos
0              Pokemaster   12000                 34                120
1                Cegatron    5500                 54                 34
2            Pikame Mucho    2350                 36                 59
3     Lazarillo de Tormes    4800                 78                  9
4           Stevie Wonder    8900                 56                 15
5                  Needle    6640                 12                 51
6            El AyMeDuele    1280                 34                103
7         El Desretinador    1040                  4                 72
8         Sacamel Ojocles   23100                  0                 39
9                Desojado   16700                 18                 23
10  Maribel Buenas Noches   15000                 45                 10
11                Cíclope   13400                 23                 62
12         El Cuatro Ojos   19600                  5                 59

In [ ]:
#El nombre del producto es string, entonces no se pueden aplicar directamente las agregaciones.
#Para poder hacerlo necesitapos aplicar un drop a esa columna.
df_dropped = df.drop(columns=['producto'])
df_dropped

    precio  cantidad_en_stock  cantidad_vendidos
0    12000                 34                120
1     5500                 54                 34
2     2350                 36                 59
3     4800                 78                  9
4     8900                 56                 15
5     6640                 12                 51
6     1280                 34                103
7     1040                  4                 72
8    23100                  0                 39
9    16700                 18                 23
10   15000                 45                 10
11   13400                 23                 62
12   19600                  5                 59

In [ ]:
# El valor mínimo de cada columna
mins = df_dropped.min()
mins

precio               1040
cantidad_en_stock       0
cantidad_vendidos       9
dtype: int64

In [ ]:
# El valor máximo de cada columna
maxs = df_dropped.max()
maxs

precio               23100
cantidad_en_stock       78
cantidad_vendidos      120
dtype: int64

In [ ]:
# El promedio por columna
means = df_dropped.mean()
means

precio               10023.846154
cantidad_en_stock       30.692308
cantidad_vendidos       50.461538
dtype: float64

In [ ]:
# La mediana por columna (El valor que se encuentra a la mitad de la secuencia ordenada de valores)
medians = df_dropped.median()
medians

precio               8900.0
cantidad_en_stock      34.0
cantidad_vendidos      51.0
dtype: float64

In [ ]:
# La desviación estándar por columna
stds = df_dropped.std()
stds

precio               7210.205196
cantidad_en_stock      23.382275
cantidad_vendidos      34.289492
dtype: float64

In [ ]:
# Verificación
def resumen_estadistico(df, df_dropped, mins, maxs, means, medians, stds):
    
    import pandas as pd
    
    error = False
    
    df_dropped_2 = df.drop(columns=['producto'])
    if not df_dropped_2.equals(df_dropped):
        print(f'La columna no-numérica no fue eliminada correctamente... Por favor inténtalo de nuevo')
        error = True
        
    if not df_dropped.min(axis=0).equals(mins):
        print(f'El valor mínimo no fue computado adecuadamente... Por favor inténtalo de nuevo')
        error = True
        
    if not df_dropped.max(axis=0).equals(maxs):
        print(f'El valor máximo no fue computado adecuadamente... Por favor inténtalo de nuevo')
        error = True
        
    if not df_dropped.mean(axis=0).equals(means):
        print(f'El promedio no fue computado adecuadamente... Por favor inténtalo de nuevo')
        error = True
    
    if not df_dropped.median(axis=0).equals(medians):
        print(f'La mediana no fue computada adecuadamente... Por favor inténtalo de nuevo')
        error = True
        
    if not df_dropped.std(axis=0).equals(stds):
        print(f'La desviación estándar no fue computada adecuadamente... Por favor inténtalo de nuevo')
        error = True
    
    if not error:
        rango = maxs - mins
        mins.name = 'Min'
        maxs.name = 'Max'
        rango.name = 'Rango'
        means.name = 'Promedio'
        medians.name = 'Mediana'
        stds.name = 'Std'
        
        resumen = pd.concat([mins, maxs, rango, means, medians, stds], axis=1)
        print(resumen)

resumen_estadistico(df, df_dropped, mins, maxs, means, medians, stds)

                    Min    Max  Rango      Promedio  Mediana          Std
precio             1040  23100  22060  10023.846154   8900.0  7210.205196
cantidad_en_stock     0     78     78     30.692308     34.0    23.382275
cantidad_vendidos     9    120    111     50.461538     51.0    34.289492

**Ejemplo 4**
Identificación y conteo de NaNs

- Aprender a identificar NaNs
- Aprender a realizar conteo de NaNs por fila y por columna

In [ ]:
tienda2 = {
    'precio':[34,56,np.nan,450,456],
    'cantidad_en_stack':[3,6,10,50,2],
    'productos_vendidos': [3,56,30,40,np.nan]
}

df = pd.DataFrame(tienda2, index=['Tacos', 'Jabón', 'Ropa', 'Latas', 'Computadora'])
df

             precio  cantidad_en_stack  productos_vendidos
Tacos          34.0                  3                 3.0
Jabón          56.0                  6                56.0
Ropa            NaN                 10                30.0
Latas         450.0                 50                40.0
Computadora   456.0                  2                 NaN

In [ ]:
#Función lógica para identificar si hay NAs
df.isna()

             precio  cantidad_en_stack  productos_vendidos
Tacos         False              False               False
Jabón         False              False               False
Ropa           True              False               False
Latas         False              False               False
Computadora   False              False                True

In [ ]:
#Pedir que entregue una suma de esos elementos
df.isna().sum(axis=1)

Tacos          0
Jabón          0
Ropa           1
Latas          0
Computadora    1
dtype: int64

In [ ]:
#Alternativas: eliminar NAs con dropna
#Por defecto es por fila
df.dropna()

       precio  cantidad_en_stack  productos_vendidos
Tacos    34.0                  3                 3.0
Jabón    56.0                  6                56.0
Latas   450.0                 50                40.0

In [ ]:
#Para hacer el dropna por columna
df.dropna(axis=1)

             cantidad_en_stack
Tacos                        3
Jabón                        6
Ropa                        10
Latas                       50
Computadora                  2

In [ ]:
#Para rellenar los NA con un valor específico
df.fillna(0)

             precio  cantidad_en_stack  productos_vendidos
Tacos          34.0                  3                 3.0
Jabón          56.0                  6                56.0
Ropa            0.0                 10                30.0
Latas         450.0                 50                40.0
Computadora   456.0                  2                 0.0

In [ ]:
df['productos_vendidos'] = df['productos_vendidos'].fillna(0)
df

             precio  cantidad_en_stack  productos_vendidos
Tacos          34.0                  3                 3.0
Jabón          56.0                  6                56.0
Ropa            NaN                 10                30.0
Latas         450.0                 50                40.0
Computadora   456.0                  2                 0.0

In [ ]:
df = df.dropna(axis=0)
df

             precio  cantidad_en_stack  productos_vendidos
Tacos          34.0                  3                 3.0
Jabón          56.0                  6                56.0
Latas         450.0                 50                40.0
Computadora   456.0                  2                 0.0

Archivos CSV

In [13]:
#Archivos locales
#Con URL
casas = pd.read_csv('https://raw.githubusercontent.com/beduExpert/Procesamiento-de-Datos-con-Python-Santander/master/Datasets/melbourne_housing-raw.csv')
casas.head(5)

       Suburb             Address  ...             Regionname Propertycount
0  Abbotsford       68 Studley St  ...  Northern Metropolitan        4019.0
1  Abbotsford        85 Turner St  ...  Northern Metropolitan        4019.0
2  Abbotsford     25 Bloomburg St  ...  Northern Metropolitan        4019.0
3  Abbotsford  18/659 Victoria St  ...  Northern Metropolitan        4019.0
4  Abbotsford        5 Charles St  ...  Northern Metropolitan        4019.0

[5 rows x 21 columns]

In [14]:
casas.shape

(19740, 21)

In [6]:
casas.isna().sum()

Suburb               0
Address              0
Rooms                0
Type                 0
Price             4344
Method               0
SellerG              0
Date                 0
Distance             8
Postcode             8
Bedroom2          4413
Bathroom          4413
Car               4413
Landsize          4796
BuildingArea     11123
YearBuilt        10389
CouncilArea       4444
Lattitude         4292
Longtitude        4292
Regionname           8
Propertycount        8
dtype: int64

In [9]:
# Las columnas 'BuildingArea' y 'YearBuilt' tienen más de 10mil NAs, eliminar columnas
casas_2 = casas.drop(columns=['BuildingArea', 'YearBuilt'])
casas_2.isna().sum()

Suburb              0
Address             0
Rooms               0
Type                0
Price            4344
Method              0
SellerG             0
Date                0
Distance            8
Postcode            8
Bedroom2         4413
Bathroom         4413
Car              4413
Landsize         4796
CouncilArea      4444
Lattitude        4292
Longtitude       4292
Regionname          8
Propertycount       8
dtype: int64

In [10]:
#Rellenar los campos NA de columna Regionname con Unknown
casas_2['Regionname'] = casas_2['Regionname'].fillna('Unknown')

In [12]:
#Eliminar filas que contienen al menos un NA
casas_3 = casas_2.dropna(axis=0, how='any')
casas_3.isna().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         0
Postcode         0
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
CouncilArea      0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64

In [17]:
casas_3.shape

(11646, 19)

Reto 

StarWars

In [18]:
starwars = pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/star-wars-survey/StarWars.csv', encoding='ISO-8859-1')
starwars.head(5)

   RespondentID  ... Location (Census Region)
0           NaN  ...                 Response
1  3.292880e+09  ...           South Atlantic
2  3.292880e+09  ...       West South Central
3  3.292765e+09  ...       West North Central
4  3.292763e+09  ...       West North Central

[5 rows x 38 columns]

In [19]:
starwars.columns

Index(['RespondentID',
       'Have you seen any of the 6 films in the Star Wars franchise?',
       'Do you consider yourself to be a fan of the Star Wars film franchise?',
       'Which of the following Star Wars films have you seen? Please select all that apply.',
       'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8',
       'Please rank the Star Wars films in order of preference with 1 being your favorite film in the franchise and 6 being your least favorite film.',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14',
       'Please state whether you view the following characters favorably, unfavorably, or are unfamiliar with him/her.',
       'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19',
       'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23',
       'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26', 'Unnamed: 27',
       'Unnamed: 28', 'Which character shot first?',
       'Are you familiar with the Expanded Universe?',
       'Do you consider yourself to be a fan of the Expanded Universe?æ',
       'Do you consider yourself to be a fan of the Star Trek franchise?',
       'Gender', 'Age', 'Household Income', 'Education',
       'Location (Census Region)'],
      dtype='object')

Pregunta: Película favorita

In [22]:
#Subgrupo de fans
starwars2 = starwars[starwars['Do you consider yourself to be a fan of the Star Wars film franchise?']=='Yes']
starwars2.head(5)

   RespondentID  ... Location (Census Region)
1  3.292880e+09  ...           South Atlantic
4  3.292763e+09  ...       West North Central
5  3.292731e+09  ...       West North Central
6  3.292719e+09  ...          Middle Atlantic
7  3.292685e+09  ...       East North Central

[5 rows x 38 columns]

In [25]:
#Eliminar columnas innecesarias
starwars2_drop = starwars2.drop(columns=['Which of the following Star Wars films have you seen? Please select all that apply.',
       'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8','Please state whether you view the following characters favorably, unfavorably, or are unfamiliar with him/her.',
       'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19',
       'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23',
       'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26', 'Unnamed: 27',
       'Unnamed: 28', 'Which character shot first?',
       'Are you familiar with the Expanded Universe?', 'Do you consider yourself to be a fan of the Star Trek franchise?',
       'Do you consider yourself to be a fan of the Expanded Universe?æ','Household Income', 'Location (Census Region)'])
starwars2_drop.head(5)

   RespondentID  ...                         Education
1  3.292880e+09  ...                High school degree
4  3.292763e+09  ...  Some college or Associate degree
5  3.292731e+09  ...  Some college or Associate degree
6  3.292719e+09  ...                   Bachelor degree
7  3.292685e+09  ...                High school degree

[5 rows x 12 columns]

In [ ]:
#Lista de películas